# LoadComponent Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadComponent Properties
LoadComponent Class See Also
---
The LoadComponent type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Factor | Load component factor. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LoadCaseOrCombinationId | Load case or combination id. |

# See Also
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace